#Забавные строки
#депонстрирует сцепление и повторение строк

print('Две строки можно ' + 'сцепить с помощью оператора "+".')
print('\nЭта строка ' + 'вряд ли ' + ' удив' + 'ит вас. ' \
      + 'но интересно. ' + 'что' + ' она - \n' + 'одна длинная-длин' \
      + 'на' +'я' + 'строка. сцепленная ' \
      + 'из ' + 'двадцати двух\n' + 'отдельных строк, разбитых ' \
      + 'на шесть строк.' + ' Достаточно ли вы' + ' впечатлены? ' + 'Ну, хватит.\n' \
      + 'пот ' + 'наша ' + 'длинная' + ' строка и закончилась!')
