# Отгадай число
#
# Компьютер выбирает случайное число от 1 до 100
# Игрок пытается отгадать это число, и компюьтер говорит,
# предложение больше/меньше, чем загаданное число,
# или попало в точку

import random



print("\n\n\tДобро пожаловать в игру 'Отгадай число'!")
print("\nЯ загадал натуральное число из даипазона от 1 до 100.")
print("Постарайтесь отгадать его за минимальное число попыток.\n")

# Начальные значения
the_number = random.randint(1, 100)
guess = int(input("Ваше предложение: "))
tries = 1

# Цикл отгадывания
while guess != the_number:
  if guess > the_number:
    print("Меньше.")
  else:
    print("Больше.")
  guess = int(input("Ваше предложение: "))
  tries += 1

# Поздравление игрока
print("Вам удалось угадать число! Это в самом деле", the_number)
print("Вы затратили на отгадывание всего лишь", tries, "попыток!\n")

input("Нажмите Enter, чтобы выйти")
