#Воображаемые благодарности
#Програма показывает работу экранированных(escape)-последовательностей

print('\t\t\tВоображаемые благодарности')
print('\t\t\t\\ \\ \\ \\ \\ \\ \\')
print('\t\t\tразработчика игры')
print('\t\t\tМайкла Доусона')
print('\t\t\t\\ \\ \\ \\ \\ \\ \\')
print('\nОтдельное спасибо хотелось бы сказать:')
print('моему парикмахеру Генри по прозвищу \"Великолепный\", который не знает слово \'невозможно\'.')

#Звучит системный динамик
print('\a')
input('Нажмите Enter, чтоы выйти.')
