# Бесполезные факты
#
# Узнает у пользователя его личные данные и выдает несколько фактов
# о нем. Эти факты истинны, но абсолютно бесполезны.


# Получение пользовательского ввода
name = input("Привет, как тебя зовут? ")

age = input("Сколько тебе лет? ")
age = int(age)

weight = int(input("Хорошо, и последний вопрос. Сколько в тебе килограммов? "))


# Вывод name на экран в нижнем и верхнем регистре
print("\nЕсли бы поэт Каммингс адресовал тебе письмо, он обратился бы к тебе так: ", name.lower())

print("А если бы это был рехнувшийся Каммингс, то так: ", name.upper())


# Пятикратный вывод имени
called = name * 5
print("\nЕсли бы маленький ребенок решил привлечь твое внимание",)
print("он произнес бы твое имя так:")
print(called)


# Подсчет количества секунд
seconds = age * 365 * 24 * 60 * 60
print("\nТвой нынешний возраст - свыше", seconds, "секунд")

# Вычисление значений moon_weight и sun_weight
moon_weight = weight / 6
print("\nЗнаете ли вы, что на Луне вы бы весили всего", moon_weight, "кг?")

sun_weight = weight * 27.1
print("А вот находясь на Солнце, вы бы весили", sun_weight, "кг. (Но, увы, это продолжалось бы недолго...)")

input("\n\nНажмите Enter, чтобы выйти.")
